---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.StructuralType
zh: 族实例
source: html/5072fbf4-e8e5-21df-d92e-476104c1418c.htm
---
# Autodesk.Revit.DB.FamilyInstance.StructuralType Property

**中文**: 族实例

Provides the primary structural type of the instance, such as beam or column etc.

## Syntax (C#)
```csharp
public StructuralType StructuralType { get; }
```